examples/hello-generated.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">
    <soap:Header>
        <wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Hello</wsa:Action>
        <wsa:MessageID>urn:uuid:23ed330d-3afe-4fc3-a276-654c85ffcea1</wsa:MessageID>
        <wsd:AppSequence InstanceId="1740902112" SequenceId="urn:uuid:373aa517-5b2f-4638-be24-8030d69d6d55" MessageNumber="0" />
    </soap:Header>
    <soap:Body>
        <wsd:Hello>
            <wsa:EndpointReference>
                <wsa:Address>urn:uuid:6bf93afb-f524-4e2e-9fa9-82ac80a366dd</wsa:Address>
            </wsa:EndpointReference>
            <wsd:XAddrs>http://192.168.12.5:5357/6bf93afb-f524-4e2e-9fa9-82ac80a366dd</wsd:XAddrs>
            <wsd:MetadataVersion>1</wsd:MetadataVersion>
        </wsd:Hello>
    </soap:Body>
</soap:Envelope>
